spec/support/fixtures/CreateSaleOrderRequest.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ser="http://uniware.unicommerce.com/services/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:UsernameToken wsu:Id="UsernameToken-1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:Username>uniware_user</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">random_password</wsse:Password></wsse:UsernameToken></wsse:Security></env:Header><env:Body><ser:CreateSaleOrderRequest><ser:SaleOrder><ser:Code>Order001</ser:Code><ser:DisplayOrderCode>Order001</ser:DisplayOrderCode><ser:DisplayOrderDateTime>2014-05-11T10:36:00Z</ser:DisplayOrderDateTime><ser:NotificationEmail>johndoe@gmail.com</ser:NotificationEmail><ser:NotificationMobile>+911234567890</ser:NotificationMobile><ser:CashOnDelivery>true</ser:CashOnDelivery><ser:Addresses><ser:Address id="1"><ser:Name>John Doe</ser:Name><ser:AddressLine1>Shipping Address 001</ser:AddressLine1><ser:City>Bangalore</ser:City><ser:State>Karnataka</ser:State><ser:Country>IN</ser:Country><ser:Pincode>560001</ser:Pincode><ser:Phone>+911234567890</ser:Phone></ser:Address><ser:Address id="2"><ser:Name>John Doe</ser:Name><ser:AddressLine1>Billing Address 001</ser:AddressLine1><ser:City>Bangalore</ser:City><ser:State>Karnataka</ser:State><ser:Country>IN</ser:Country><ser:Pincode>560001</ser:Pincode><ser:Phone>+911234567890</ser:Phone></ser:Address></ser:Addresses><ser:ShippingAddress ref="1"></ser:ShippingAddress><ser:BillingAddress ref="2"></ser:BillingAddress><ser:SaleOrderItems><ser:SaleOrderItem><ser:ItemSKU>SKU_001</ser:ItemSKU><ser:ShippingMethodCode>STD</ser:ShippingMethodCode><ser:TotalPrice>10308</ser:TotalPrice><ser:SellingPrice>10308</ser:SellingPrice><ser:Discount>2691</ser:Discount><ser:Code>5501</ser:Code><ser:CustomFields><ser:CustomField name="itemCustomField001" value="itemCustomField001_Value"></ser:CustomField><ser:CustomField name="itemCustomField002" value="itemCustomField002_Value"></ser:CustomField></ser:CustomFields></ser:SaleOrderItem><ser:SaleOrderItem><ser:ItemSKU>SKU_002</ser:ItemSKU><ser:ShippingMethodCode>STD</ser:ShippingMethodCode><ser:TotalPrice>5154</ser:TotalPrice><ser:SellingPrice>5154</ser:SellingPrice><ser:Discount>1345</ser:Discount><ser:Code>5502-1</ser:Code></ser:SaleOrderItem><ser:SaleOrderItem><ser:ItemSKU>SKU_002</ser:ItemSKU><ser:ShippingMethodCode>STD</ser:ShippingMethodCode><ser:TotalPrice>5154</ser:TotalPrice><ser:SellingPrice>5154</ser:SellingPrice><ser:Discount>1345</ser:Discount><ser:Code>5502-2</ser:Code></ser:SaleOrderItem><ser:SaleOrderItem><ser:ItemSKU>SKU_003</ser:ItemSKU><ser:ShippingMethodCode>STD</ser:ShippingMethodCode><ser:TotalPrice>9082</ser:TotalPrice><ser:SellingPrice>9082</ser:SellingPrice><ser:Discount>917</ser:Discount><ser:VoucherCode>special_offer</ser:VoucherCode><ser:Code>5503</ser:Code></ser:SaleOrderItem></ser:SaleOrderItems><ser:CustomFields><ser:CustomField name="customField001" value="customField001_Value"></ser:CustomField><ser:CustomField name="customField002" value="customField002_Value"></ser:CustomField></ser:CustomFields></ser:SaleOrder></ser:CreateSaleOrderRequest></env:Body></env:Envelope>
